---
kind: method
id: M:Autodesk.Revit.DB.GeomCombinationSet.Insert(Autodesk.Revit.DB.GeomCombination)
source: html/109a97a9-dac8-9853-ba10-8ebef93caad0.htm
---
# Autodesk.Revit.DB.GeomCombinationSet.Insert Method

Insert the specified element into the set.

## Syntax (C#)
```csharp
public virtual bool Insert(
	GeomCombination item
)
```

## Parameters
- **item** (`Autodesk.Revit.DB.GeomCombination`) - The GeomCombination to be inserted into the set.

## Returns
Returns whether the GeomCombination was inserted into the set.